# 抢劫罪
# 事后抢劫（转化型抢劫）
# 行为人犯（盗窃、诈骗、抢夺）罪时，为了抗拒抓捕、窝藏赃物、毁灭罪证而当场使用暴力或者以暴力相胁迫的，以抢劫论
# 以犯（盗窃、诈骗、抢夺）罪后，伤害了新的法益为基础原理（以自杀、自残相威胁的不算）

# 诈骗罪 = 以非法占有为目的，实施欺诈行为（使对方产生或继续维持错误认识（具有处分意识，即知情，例如，点击陌生链接被盗财物，属于盗窃，而非诈骗），并给予错误认识处分财产，让对方遭受财产损失）
# “对方基于错误认识处分财产” 包括两个要素 = 处分能力（处分权限 注意：被处分的财物等，不需要属于被诈骗对象） and 处分意识

# 盗窃罪 VS 侵占罪 
# 盗窃对象为他人占有的财物 VS 侵占罪的对象为自己占有的他人财物或者脱离占有物（他人的遗忘物、埋藏物）
# 当主人将财物遗忘（遗失）在某个场所，主人失去对财物的占有时，他人拿走该财物的定性！！！
p=''
if (p in '公共场所'):
	('构成侵占')
else: #(相对比较封闭的空间，如宾馆房间、大巴后备箱等)
	('财物转为场所的管理者占有，他人拿走的，构成盗窃')

# 盗窃罪 VS 抢夺罪
# 平和方式 VS 暴力方式

# 敲诈勒索罪 = 以非法占有为目的，对他人实行威胁，索取公私财物数额较大或者多次索取公私财物行为

# 贪污罪 = 国家工作人员利用职务上的便利，侵吞、窃取、骗取或以其他手段非法占有公共财物的

# 职务侵占罪 = 非国有公司、企业或者其他单位的人员，利用职务之便侵吞本单位财物的，构成职务侵占罪

# 非法侵占 VS 贪污 
# 一个比较简单的判断方法，非法侵占的财产是自己管理的，定贪污；属于他人管理的，定盗窃或其他罪


# 罪刑法定原则 = 法无明文规定不为罪，法无明文规定不处罚
# 必须是成文法，不能是习惯法
# 禁止不利于行为人的事后法，但不禁止有利于行为人的事后法
# 允许扩大解释：当刑法的真实含义比字面含义宽时，扩张字面含义的解释方法
# 禁止（不利于行为人的）类推解释：对于法律没有明文规定的行为，适用有类似规定的其他条文予以处罚

# 当然解释：刑法规定虽未明示，但依形式逻辑、规范目的及事物属性的当然道理，将该事项解释为包括在该规定的适用范围之内

# 我国刑法溯及力 = 从旧兼从轻的原则

# 想象竞合犯 VS 法条竞合犯
# 一行为侵犯数个法益 VS 一行为触犯数个法条，数法条在法益上往往具有包容或交叉关系，如非法拘禁罪和绑架罪

# 管制犯 VS 缓刑犯 VS 假释犯
# 禁止令

# 利用影响力受贿罪 
# 1、国家工作人员的近亲属 or 其他与之有密切关系的人 + 通过该国家工作人员职务上的行为 or 利用其职权或地位形成的便利条件 + 为请托人谋取不正当利益，索取利益数额较大或其他严重情节的
# 2、离职的国家工作人员或其近亲属以及与其关系密切的人。。。

# 行贿罪
# 要求行为人主观上“为谋取不正当利益”，才构成行贿罪；“谋取正当利益的”，不构成行贿罪，但受贿罪同样成立

# 玩忽职守罪 = 国家工作人员（主体） + 严重不负责任，不履行职责或不正确履行职责 + 以过失为特征之一

# 徇私枉法罪 = 司法工作人员（主体） + 在刑事诉讼活动中，违背事实和法律作枉法裁判

# 渎职罪 = 主体不限于国家机关工作人员，还包括在国家机关履行公务但没有正式编制的人员

# 挪用公款罪
# 挪用期间，以销毁账目的方式，使得单位丧失公款追索权利的，侵犯的不再单纯是单位对公款的使用权，而是所有权，应当按照贪污罪处理
# 是属于自然人犯罪；单位挪用公款的，单位不成立挪用公款罪

# 非法经营罪 = 未经国家有关主管部门批准，非法经营证券、期货、保险业务的，或者非法从事资金支付结算业务的

# 盗伐林木罪 = 主观上具有非法占有目的 + 侵犯的法益是国家的森林资源（行为对象为树木）

# 贩卖毒品罪 
# 有偿转让毒品（不需要以营利为目的）或者以贩卖为目的而非法收购毒品，即“卖”或”为卖而买“
# 贩卖包括出售、为出售而购买、居间介绍买卖、不要求营利目的（为供本人吸食而购买的，不属于贩卖；为他人购买仅用于吸食的毒品，不以牟利为目的的，不定为贩卖毒品罪，但，数量超过最低数量标准的，以非法持有毒品罪定罪）

# 运输毒品 = 一般认为行为使毒品离开原处或转移了存放地的，属于既遂

# 脱逃罪
# 主体 = 依法被关押的罪犯、被告人、犯罪嫌疑人（不包括强制戒毒人员）

# 窝藏罪
# 窝藏的对象 = 犯罪的人
		
# 聚众斗殴罪 = 聚集多人攻击对方身体或者互相供给对方身体的行为。
# 聚众斗殴致人重伤、死亡的，以故意伤害罪、故意杀人罪定罪处罚。
# 只应对直接造成死亡的斗殴者和首要分子认定为故意杀人罪；在不能查明死亡原因的情况下，不宜将所有斗殴者认定为故意杀人罪。（出于刑法谦抑性）

# 贷款诈骗罪 = 以非法占有为目的，骗取银行贷款的，构成贷款诈骗罪
# 主体必须是自然人

# 使用假币罪
# 与诈骗罪是法条竞合关系，是特殊的诈骗行为，以使用假币罪定罪
# “使用”是指一定要将假币置于流通领域，否则不成立使用假币罪

# 信用卡诈骗罪 = 以非法占有为目的，利用信用卡进行诈骗活动，骗取数额较大财物的行为
# 包括：
# 1 使用伪造的信用卡或者使用虚拟的身份证明骗领的行用卡
# 2 使用作废的信用卡 
# 3 冒用他人信用卡 
# 4 恶意透支
# 例外：除盗窃和抢劫获得信用卡并使用信用卡（按盗窃罪和抢劫罪论处）之外，均按信用卡诈骗罪定罪

# 掩饰、隐瞒犯罪所得、犯罪所得收益罪 = 明知是他人的犯罪所得及产生的收益，而予以窝藏、转移、收购、代为销售或者以其他方式掩饰、隐瞒的行为
# 行为人有积极的掩饰、隐瞒行为，单纯知情不举的行为（拒绝提供间谍犯罪证据罪外），不构成犯罪

# 非法拘禁罪 = 为索取债务（含赌债，高利贷等法律不予保护的债务）而非法扣押、拘禁他人的，构成非法拘禁罪，不构成绑架罪、抢劫罪。
# 非法拘禁致人死亡 = 指的是非法拘禁行为本身导致人死亡，不包括被害人自杀行为
# 非法拘禁的结果加重犯 = 指基本犯罪行为本身导致了加重结果
# 非法拘禁罪 VS 绑架罪
# 

# 侮辱罪 VS 强制猥亵、侮辱（妇女）罪 （注：刑修（九）去掉了妇女）
# 法益是他人的名誉 VS (妇女)他人的性的自己决定权

# 侮辱罪 VS 诽谤罪
# 方法 包括口头、文字、暴力的 VS 仅口头、文字的
# 行为 包括可以不用具体实施，也可以用真实事实损害他人名誉 VS 捏造并散布有损他人名誉的虚假事实的行为

# 诽谤罪 VS 诬告陷害罪（主观目的是意图使他人受刑事追究）
# 共同点：捏造事实
# 对名誉的犯罪 VS 对人身自由的犯罪
# 向没有限定的他人散布虚假事实败坏他人名誉 VS 向公安、司法等机关告发虚假的犯罪事实