# 合同履行中的三大抗辩
# 先履行抗辩、不安抗辩、同时履行抗辩权

# 有名合同 无名合同
# 有名：买卖，供水电气热，赠予，借款，租赁，承揽，建设，融资，技术，运输，行纪，委托，保管，居间，仓储
# 仓储合同：是有偿合同；诺成性合同；存货人或仓单持有人在没有约定或约定不明确时，可以随意提取；
# 保管合同：可以有偿、可以无偿；实践性合同；寄存人有权随时提取保管物；保管人的责任属于过错责任


# 要式合同、非要式合同；诺成性合同
class Contract: # 合同
	def Dismissal:# 解除合同
		if():# 根本违约，合同目的无法实现
			pass
	def Cancel: # 撤销合同
		if():
			pass


class CommercialHousingContract:# 商品房买卖合同
	def Dismissal:# 解除合同
		if():#套内面积与合同约定面积误差比超过5%；买卖合同成立后，抵押给第三人的；房屋主体结构之类不合格的
			pass

class ConstructionContract: # 建设工程合同
	pass	# 建设单位未取得施工资质的，施工合同无效，但事后竣工验收合格的，法院支持承包人按照合同约定支付工程价款