# 证据
# 直接证据 VS 间接证据  （按单个证据与证明对象之间的关系）
# 能单独地、直接地证明待证事实的证据 VS 单个证据无法之间证明待证事实而通过与其他证据联合在一起，方有可能证明待证事实的证据

# 原始证据 VS 传来证据
# 直接来源于案件事实的证据，即第一手资料 VS 从原始证据中派生出来的证据

# 本证 VS 反证  （根据证据与证明责任承担的关系）
# 在民事诉讼中，负有证明责任的一方当事人提成的用于证明自己所主张事实的证据 VS 没有证明责任的一方当事人提成的用于证明对方主张事实不真实的证据

# 管辖
# 管辖恒定原则 = 指的是确定管辖，以起诉时为标准时点，一个案件在原告起诉时有管辖权的法院，从始至终都要管辖权，不因当事人住所地、行政区域的变化而丧失管辖权
# 一般地域管辖规则 = 被告所在地、合同履行地（如果履行了的情况下）、侵权发生地
# 例外：离婚中可以原告所在地；赡养费中可以原告所在地；遗产纠纷中可以被继承人所在地
# 四层级别
# 基层法院(大多数归基层管；部分知识产权案)、中级法院(大多数知识产权案)、高级法院(本辖区里重大；涉外)、最高院(全国重大；认为由本院审理的)
# 受移送法院不得拒绝移送的案件；接收被移交案件的法院，如果认为也没有管辖权，不得退回，应报请上级法院指定管辖