# 已满14周岁未满16周岁，需要负刑事责任的8种情况：故意杀人、故意伤害致重伤或死、强奸、抢劫、贩毒、防火、爆炸、投放危险物质

# 犯罪构成 = 犯罪客体要件 + 犯罪客观要件（行为、结果、行为对象等） + 犯罪主体要件 + 犯罪主观要件（故意、过失、目的等）
# 记述要件 = 只需要法官的认识活动即可确定的
# 规范要件 = 需要司法人员的规范评价和价值判断来确定的
# 积极要件 = 积极、正面地表名成立犯罪必须的要素
# 消极要件 = 与积极要件相反
# 共同的构成要件 = 指犯罪构成共同要件中为任何犯罪的成立所必须具备的要素，如客观要件的要素
# 非共同的构成要件 = 部分犯罪的成立所必须具备的要素
# 成文的构成要件 = 刑法明文规定的构成要件要素
# 不成文的构成要件 = 刑法条文没有明文规定，但根据条文之间的相互关系等对相关要素的描述所确定的

# 不作为犯罪
# 真正（纯）不作为犯 VS 不真正（假的）不作为犯
# 刑法明文规定了保证人（义务人）与不作为内容的犯罪 VS 虽没有明文规定，但行为人以不作为实施了通常由作为而实现构成要件的犯罪
	if (行为人负有实施特定积极行为的具有法律性质的义务，不包括道德义务)&&(行为人能够履行特定义务)&&(行为人没有履行特定义务，造成或可能造成危害结果):
		(不作为犯罪)

# 刑法中的因果关系
# 客观上的危害行为 + 危害结果，不可假设
	if(行为人的危害行为):
		if(有介入的因素)&&(介入因素是低概率事件)&&(介入因素对危害结果产生决定性影响): # 产生中断
			(无因果关系)
		else:
			(有因果关系)
			
	if (有因果关系)&&(有主观故意):# 主观故意，不一定要有规范的要素，规范要素是司法人员判断的，而非行为人
		(犯罪)
		
# 不可罚的不能犯，包括三种：方法不能；对象不能；主体不能（如受贿罪，需要国家公务人员身份）
# 本质特点：缺乏实现犯罪的危险性

# 事实认识错误包括三种：对象错误、打击错误、因果关系的错误

# 对象错误 VS 打击错误，认错人 VS 打错人，要伤害的人没有出现在事件中 VS 要伤害的人出现在事件中

# 牵连犯 VS 吸收犯
# 共同点：均是数个行为、成立数罪、而不实行数罪并罚
# 区别：牵连犯是目的行为与手段行为、原因行为与结果行为之间的牵连；吸收犯是一行为是另一行为的必经过程或当然结果

# 想象竞合犯：一个行为，触犯数个罪名，从一重罪论处

# 事后不可罚的行为：看后行为有没有侵害新的、独立的法益

# 受贿罪既遂
	if (国家工作人员) &&(面临被追溯、被查处而退还或上交的):
		(构成受贿罪)
	else:# 主动及时退还或上交的
		(不构成受贿罪)
		
# 犯罪中止 VS 犯罪未遂
# 犯罪行为人主观上，能达目的而不欲 VS 犯罪行为人主观上，欲达目的而不能



































