# 自然人享有 生命权、身体权、健康权、姓名权、肖像权、名誉权、荣誉权、隐私权、婚姻自主权


# 遗产
# 遗嘱类型：自书（须签名 + 注明年月日）、代书、录音、口头（应两个以上无利害关系人在场见证，且危急情况解除后，遗嘱人能够用书面或者录音形式立遗嘱的，所立的口头遗嘱无效）、公证
# 法定继承顺序，第一顺位 配偶、子女、父母；第二顺位，兄弟，祖父母，外祖父母
# 继承顺序，遗赠抚养协议 > 遗赠
# 继承顺序，公证遗嘱 > 非公证遗嘱;含有公证遗嘱的，以最后立的公证遗嘱为准；无公证遗嘱的，以最后立的遗嘱为准


# 代理
# 无权代理（表见代理，“表见”即须有介绍信、授权书、盖公章的空白合同、合同专用章等）
# 无权代理效力待定，视委托人事后是否追认


# 无因管理
# 1、没有法定或约定的义务；2、主观上包含有为了避免他人利益受损而具有管理他人事务的意思；3、客观上实施了管理他人事务的行为

# 保险
# 足额保险合同： 保险金额 = 保险价值，保险事故后，保险人全额赔; 不足额保险合同：保险金额 < 保险价值，保险事故后，保险人按比例赔
# 投保
	if (没有指定受益人 or 受益人指定不明) or (受益人先于被保险人死亡，没有其他受益人的) or (受益人依法丧失受益权 or 放弃受益权，没有其他受益人的): # 受益人和被保险人在同一事件中死亡，无法确定先后顺序的，推定受益人死亡在先
		(保险金作为被保险人的遗产)
		
	if (故意未履行如实告知义务)&&(自合同成立之日起未超过2年):
		(保险人可解除保险合同)
			
	if (故意未履行如实告知义务)&&(自保险人知道事由起超过30日):
		(不行使，则解除权消灭)
			
	if(发生保险事故):
		if (故意未履行如实告知义务)&&(合同解除之前发生保险事故):
			(不承担赔偿或给付保险金 + 不退保费)				
			
	if (重大过失未履行如实告知义务):
		(不承担赔偿或给付保险金 + 应当退还保费)
		
# 死亡保险
# 未经被保险人同意并认可保险金额的，合同无效
# 不得为无民事行为能力人投保以死亡为给付保险条件的人身保险，保险人也不得承保，父母为其未成年子女投保人身保险的除外

	if (合同成立或恢复效力之日起2年内):
		if (被保险人自杀) && (被保险人自杀时具有无民事行为能):
			(保险人不承担给付保险金责任)
	else:
		(保险人承担给付保险金责任)
		
		
# 紧急避险
	if (必须正在发生)&&(必须现实危险)&&(必须出于不得已损害另一法益)&&(具有正当避险意图)&&(损害无辜第三者的合法权益)&&(必须没有超过必要限度，造成不应有损害):
		(属于紧急避险)
		
# 正当防卫 VS 紧急避险
# 侵害来自于"不法侵害人"    VS    危险还可来自"动物、自然灾害，等"
# 侵害正在进行，尚未结束    VS    危险已经发生或迫在眉睫，尚未消除
# 正对不正				    VS    正对正
# 行为无价值论：需要防卫意识 + 需要避险意识
# 结果无价值论：不需要防卫意识 + 不需要避险意识

# 不作为犯罪
# 构成要件：有义务，而不履行义务，导致结果的

# 共有债务：对外连带，对内按分份

# 物权优于债权偿还

# 帮工责任 VS 用工责任
# 帮工人系无偿提供劳务 VS 有偿
# 被帮工人承担责任（被帮工人明确拒绝帮工的，免责，但可在受益范围内适当补偿） = 用工单位承担责任

# 7种典型的侵权责任
# 产：产品责任
# 车：机动车交通事故责任
# 医：医疗损害责任
# 环：环境污染责任（诉讼时效期限为3年）
# 危：高度危险责任
# 动：饲养动物损害责任
# 物：物件损害责任

# 另外7种典型的侵权责任
# 监：监护人责任
# 教：教育机构责任
# 用：用工责任
# 帮：帮工责任
# 定：定做人责任
# 安：安保义务人责任
# 网：网络服务提供者责任

# 债的保全和担保
# 债权人应对按照约定实现债权，没有约定或约定不明的，在物保和保证（人）并存时，对债务人应先执行物保；对第三人可自由选择顺序

# 担保
# 未约定保证方式和期间
# 未约定保证方式 = 推定为连带保证，诉讼时效从债权人要求保证人程度保证责任之日起计算
# 未约定保证期间 = 从主债务履行期届满之日起算6个月
# 债务人与债权人之间重新约定，而没通知担保人的，担保人仍按原约定承担责任，超出的部分免责

# 抵押权 < 物权:抵押人的行为足以使抵押物价值减少的，抵押权人有权要求抵押人停止其行为，或提供价值相当的担保，而不能直接行使权力（非金钱给付之债不能代位）

# 以交付全部或大部分购房款的消费者 > 承包人法定优先权 > 银行抵押权

# 行使留置权，应当具备的条件：
# 留置的财产，必须是债权人以合法方式占有债务人的动产（必须是动产）
# 留置的财产必须与债权人的债权有牵连关系（对动产的留置权与债务的产生是基于同一法律关系发生的），但企业间留置的除外
# 必须是债权已结期

















